<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"633baafc484d1d6829f655ae6d7948eec63e10ddc8127fd71ecc919d835c19c7","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1312 at https://github.com/cal-itp/data-infra/actions/runs/20835194714","plan_out_hash":"38d729340d103cc4c8abab0266a4034cad295f9e39cb2120ac518ca7cd6aff10","plan_hash":"fcdc6fd6680f13369747760bb8075b23d523a651ad7538c4d9e2f8c629b1504a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "xFSuPA==" -> (known after apply)
!~      detect_md5hash      = "NGoXve/VGjr9aoBxswnIxQ==" -> "different hash"
!~      generation          = 1767858563112424 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "NGoXve/VGjr9aoBxswnIxQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "hX+e2w==" -> (known after apply)
!~      detect_md5hash      = "TBbzxUyvvP0xLfuxKFlK0A==" -> "different hash"
!~      generation          = 1767858563120710 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "TBbzxUyvvP0xLfuxKFlK0A==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "dvkk/w==" -> (known after apply)
!~      detect_md5hash      = "2iQmjWm9pPPoka9CCTc+lQ==" -> "different hash"
!~      generation          = 1767854117124723 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "2iQmjWm9pPPoka9CCTc+lQ==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "E+mG5g==" -> (known after apply)
!~      detect_md5hash      = "sGQQlxv9LYG0h/1fPyiHgg==" -> "different hash"
!~      generation          = 1767836288303119 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "sGQQlxv9LYG0h/1fPyiHgg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5bBhtw==" -> (known after apply)
!~      detect_md5hash      = "SkjBFVDOwhVjXs85DP7cUA==" -> "different hash"
!~      generation          = 1767836289482643 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "SkjBFVDOwhVjXs85DP7cUA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1312](https://github.com/cal-itp/data-infra/actions/runs/20835194714)